cat_app/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "sex" = $2, "name" = $3, "description" = $4, "updated_at" = $5 WHERE "cats"."id" = $6
---
  def update
    @cat = Cat.find(params[:id])

    if @cat.update_attributes(cat_params)